src/01_software/01_editors/001.org
#+TITLE: Editors 001

#+BEGIN_EXPORT html
<pre>
<code>> ./blog-1/01_software/01_vim/001.org</code>
</pre>
#+END_EXPORT

[[https://hnvy.github.io/blog-1/][Home page]] - [[https://github.com/hnvy/blog-1/edit/main/src/01_software/01_editors/001.org][ESotP]]

-----

* Introduction
:PROPERTIES:
:CUSTOM_ID: intro
:END:
See [[https://hnvy.github.io//about.html#editors][this]].

* E#008 (2021-05-24) - day 0. (E)
:PROPERTIES:
:CUSTOM_ID: org289653e
:END:

Pearls:
- ~Ctrl~ in Emacs is writter as ~C~, ~Meta~ (aka ~Alt~) as ~M~, and ~Shift~ as ~S~.
- You can launch the Emacs tutorial using ~C-h~ and then pressing the letter ~t~.

Note: this is an old entry which I procrastinated on adding due to the reasons outlined here. Anyway, here it is (quite incomplete, to be honest).
- ~GTs~:
  - Well, finding the tutorial wasn't as bad. The link to the tutorial was quite literally on the main menu.
  - The tutorial was very dense and filled with information. I am already glad that I started to learn and explore this new realm.
  - Emacs felt a little more like the usual text editors that I am used to. In other words, it is not a modal editor like Vim (i.e., there is nothing like Insert mode, Visual mode, Normal mode, etc.).
  - The number of times I had to press either ~Ctrl~, ~Meta~, or the ~Shift~ keys is formidable.
- ~Time spent~: 30
- ~LPs~:
  - Launch the tutorial by either clicking on the button that is on the home page, or by ~C-h t~
  - The Meta key!
- ~LNs~:
  - I need to finish the tutorial

* E#007 (2022-07-08) - contents table in plain text. (V)
:PROPERTIES:
:CUSTOM_ID: org730bd82
:END:

Pearls:
- Encode your headings in Vim using ~sha256~
- Type ~:let @"=sha256('____')~ (replace the ~____~ the heading title)
- Paste the ~sha256~ hash at the start of the heading line (so you end up with something like this ~HASH# Heading 1~)
- Yank the ~HASH# Heading 1~ line and paste it at the start of your document under a ~# Table of Contents~ heading
- Place the cursor at a hash, and press ~#~ to jump to the corresponding heading
- You can use the following mapping to assist you with the above: ~nmap <M-0> ^v$hy:let @"=sha256('<C-r>"')<CR>Pyygg~ (this maps the steps 1-6 to ~Alt-0~. You can then go down and paste the content using ~p~).

Here is how to create an interactive table of contents (well, sort of) in a plain text file.

Your text file must first have some kind of structure that outlines headings. Even though it is not necessary, this step will undoubtedly make your life much simpler.

So, let's say we have the following format:

#+BEGIN_SRC
# Heading 1
## Subheading 1.1
## Subheading 1.2
## Subheading 1.3
# Heading 2
# Heading 3
## Subheading 3.1
#+END_SRC

... and you wish to rapidly traverse that file using a table of contents of some kind. What you need to have is as follows (there is really just one thing):
- ~sha256~: According to Wikipedia, ~sha256~ is a "cryptographic hash functions." In other words, it is a function which encodes the text you give it. In fact, you don't even need to use ~sha256~. You can using any algorithm which encodes your text. You can even make your own! But, why go through all the trouble of creating your own algorithm when you can use Notepad++ or Vim (as they have this as a built-in feature)?

Since this is the Vim logs (~editors_1_logs.md~) file, here is how you would go about it in Vim:
1. Press ~:~
2. Type the following: ~let @"=sha256('____')~ (replace the ~____~ with whatever text you want. In this case, the text will be our headings).
3. The command above has now made the ~"~ register in Vim equal to the ~sha256~ of our text. So, if you press ~p~, Vim will paste the content of the ~"~ register into your text file. So, to encode ~Heading 1~, we will have to write the following ~let @"=sha256('# Heading 1')~. The content of the ~"~ register will now be: ~bbc42...e1f03~ (this is known as the "hash"). We can use this unique identifier to create our table of contents.
4. Place your cursor at the beginning of the line which has ~# Heading 1~, and press ~P~. This will paste the hash right before ~# Heading 1~. So, you should have something like this ~bbc42...e1f03# Heading 1~ (I know, it looks quite ugly).
5. Now, press ~yy~ to yank (or copy) the line.
6. Press ~gg~ to go back to the start of the text file, and create a heading with a name like ~# Table of Contents~.
7. Press ~p~ to paste the line that we have yanked in the previous step. So, you should end up with something like this:
#+BEGIN_SRC
# Table of Contents
bbc42...e1f03# Heading 1
#+END_SRC
8. What we have done is, effectively, create some visible 'link' between the Table of Contents heading and the actual heading in the text file. Again, it looks ugly, but at least it works.
9. Repeat the steps above for the rest of your headings, or, you can use the following macro: ~nmap <M-0> ^v$hy:let @"=sha256('<C-r>"')<CR>Pyygg~ (this maps the steps 1-6 to ~Alt-0~. You can then go down and paste the content using ~p~. Also, to ensure that the mapping is wiped and that it does not affect you in the future, execute ~unmap <M-0>~ after you're done).
10. The end result should be something like this (To use the 'navigation feature', you can place your cursor on the hash that is under the Table of Contents, and press ~#~. This will take you straight to the desired heading.):

#+BEGIN_SRC
# Table of Contents
bbc42...e1f03# Heading 1
37ce0...bfc1c## Subheading 1.1
96620...01a72## Subheading 1.2
a8a5e...93789## Subheading 1.3
1cb48...e0efi# Heading 2
4ee32...6a839# Heading 3
b1e43...9698f## Subheading 3.1




bbc42...e1f03# Heading 1
Here is some text

37ce0...bfc1c## Subheading 1.1
Some more text!

96620...01a72## Subheading 1.2
Blah blah blah blah...

a8a5e...93789## Subheading 1.3
Running out of text ideas :\

1cb48...e0efi# Heading 2
Maybe I should have used a Lorem Ipsum generator or something...

Second paragraph.

4ee32...6a839# Heading 3
Or maybe, I should have used less headings:
- Reminder
- For
- Me

b1e43...9698f## Subheading 3.1
Anyway, I'm glad that this is done now.
#+END_SRC

