01_software/01_editors/001.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Editors 001</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://hnvy.github.io/assets/css/main.css" />
</head>
<body>
<div id="content" class="content">
<pre>
<code>> ./blog-1/01_software/01_vim/001.org</code>
</pre>

<p>
<a href="https://hnvy.github.io/blog-1/">Home page</a> - <a href="https://github.com/hnvy/blog-1/edit/main/src/01_software/01_editors/001.org">ESotP</a>
</p>

<hr />

<div id="outline-container-intro" class="outline-2">
<h2 id="intro">Introduction</h2>
<div class="outline-text-2" id="text-intro">
<p>
See <a href="https://hnvy.github.io//about.html#editors">this</a>.
</p>
</div>
</div>

<div id="outline-container-org289653e" class="outline-2">
<h2 id="org289653e">E#008 (2021-05-24) - day 0. (E)</h2>
<div class="outline-text-2" id="text-org289653e">
<p>
Pearls:
</p>
<ul class="org-ul">
<li><code>Ctrl</code> in Emacs is writter as <code>C</code>, <code>Meta</code> (aka <code>Alt</code>) as <code>M</code>, and <code>Shift</code> as <code>S</code>.</li>
<li>You can launch the Emacs tutorial using <code>C-h</code> and then pressing the letter <code>t</code>.</li>
</ul>

<p>
Note: this is an old entry which I procrastinated on adding due to the reasons outlined here. Anyway, here it is (quite incomplete, to be honest).
</p>
<ul class="org-ul">
<li><code>GTs</code>:
<ul class="org-ul">
<li>Well, finding the tutorial wasn't as bad. The link to the tutorial was quite literally on the main menu.</li>
<li>The tutorial was very dense and filled with information. I am already glad that I started to learn and explore this new realm.</li>
<li>Emacs felt a little more like the usual text editors that I am used to. In other words, it is not a modal editor like Vim (i.e., there is nothing like Insert mode, Visual mode, Normal mode, etc.).</li>
<li>The number of times I had to press either <code>Ctrl</code>, <code>Meta</code>, or the <code>Shift</code> keys is formidable.</li>
</ul></li>
<li><code>Time spent</code>: 30</li>
<li><code>LPs</code>:
<ul class="org-ul">
<li>Launch the tutorial by either clicking on the button that is on the home page, or by <code>C-h t</code></li>
<li>The Meta key!</li>
</ul></li>
<li><code>LNs</code>:
<ul class="org-ul">
<li>I need to finish the tutorial</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org730bd82" class="outline-2">
<h2 id="org730bd82">E#007 (2022-07-08) - contents table in plain text. (V)</h2>
<div class="outline-text-2" id="text-org730bd82">
<p>
Pearls:
</p>
<ul class="org-ul">
<li>Encode your headings in Vim using <code>sha256</code></li>
<li>Type <code>:let @"=sha256('____')</code> (replace the <code>____</code> the heading title)</li>
<li>Paste the <code>sha256</code> hash at the start of the heading line (so you end up with something like this <code>HASH# Heading 1</code>)</li>
<li>Yank the <code>HASH# Heading 1</code> line and paste it at the start of your document under a <code># Table of Contents</code> heading</li>
<li>Place the cursor at a hash, and press <code>#</code> to jump to the corresponding heading</li>
<li>You can use the following mapping to assist you with the above: <code>nmap &lt;M-0&gt; ^v$hy:let @"=sha256('&lt;C-r&gt;"')&lt;CR&gt;Pyygg</code> (this maps the steps 1-6 to <code>Alt-0</code>. You can then go down and paste the content using <code>p</code>).</li>
</ul>

<p>
Here is how to create an interactive table of contents (well, sort of) in a plain text file.
</p>

<p>
Your text file must first have some kind of structure that outlines headings. Even though it is not necessary, this step will undoubtedly make your life much simpler.
</p>

<p>
So, let's say we have the following format:
</p>

<pre class="example">
# Heading 1
## Subheading 1.1
## Subheading 1.2
## Subheading 1.3
# Heading 2
# Heading 3
## Subheading 3.1
</pre>

<p>
&#x2026; and you wish to rapidly traverse that file using a table of contents of some kind. What you need to have is as follows (there is really just one thing):
</p>
<ul class="org-ul">
<li><code>sha256</code>: According to Wikipedia, <code>sha256</code> is a "cryptographic hash functions." In other words, it is a function which encodes the text you give it. In fact, you don't even need to use <code>sha256</code>. You can using any algorithm which encodes your text. You can even make your own! But, why go through all the trouble of creating your own algorithm when you can use Notepad++ or Vim (as they have this as a built-in feature)?</li>
</ul>

<p>
Since this is the Vim logs (<code>editors_1_logs.md</code>) file, here is how you would go about it in Vim:
</p>
<ol class="org-ol">
<li>Press <code>:</code></li>
<li>Type the following: <code>let @"=sha256('____')</code> (replace the <code>____</code> with whatever text you want. In this case, the text will be our headings).</li>
<li>The command above has now made the <code>"</code> register in Vim equal to the <code>sha256</code> of our text. So, if you press <code>p</code>, Vim will paste the content of the <code>"</code> register into your text file. So, to encode <code>Heading 1</code>, we will have to write the following <code>let @"=sha256('# Heading 1')</code>. The content of the <code>"</code> register will now be: <code>bbc42...e1f03</code> (this is known as the "hash"). We can use this unique identifier to create our table of contents.</li>
<li>Place your cursor at the beginning of the line which has <code># Heading 1</code>, and press <code>P</code>. This will paste the hash right before <code># Heading 1</code>. So, you should have something like this <code>bbc42...e1f03# Heading 1</code> (I know, it looks quite ugly).</li>
<li>Now, press <code>yy</code> to yank (or copy) the line.</li>
<li>Press <code>gg</code> to go back to the start of the text file, and create a heading with a name like <code># Table of Contents</code>.</li>
<li>Press <code>p</code> to paste the line that we have yanked in the previous step. So, you should end up with something like this:</li>
</ol>
<pre class="example">
# Table of Contents
bbc42...e1f03# Heading 1
</pre>
<ol class="org-ol">
<li>What we have done is, effectively, create some visible 'link' between the Table of Contents heading and the actual heading in the text file. Again, it looks ugly, but at least it works.</li>
<li>Repeat the steps above for the rest of your headings, or, you can use the following macro: <code>nmap &lt;M-0&gt; ^v$hy:let @"=sha256('&lt;C-r&gt;"')&lt;CR&gt;Pyygg</code> (this maps the steps 1-6 to <code>Alt-0</code>. You can then go down and paste the content using <code>p</code>. Also, to ensure that the mapping is wiped and that it does not affect you in the future, execute <code>unmap &lt;M-0&gt;</code> after you're done).</li>
<li>The end result should be something like this (To use the 'navigation feature', you can place your cursor on the hash that is under the Table of Contents, and press <code>#</code>. This will take you straight to the desired heading.):</li>
</ol>

<pre class="example">
# Table of Contents
bbc42...e1f03# Heading 1
37ce0...bfc1c## Subheading 1.1
96620...01a72## Subheading 1.2
a8a5e...93789## Subheading 1.3
1cb48...e0efi# Heading 2
4ee32...6a839# Heading 3
b1e43...9698f## Subheading 3.1




bbc42...e1f03# Heading 1
Here is some text

37ce0...bfc1c## Subheading 1.1
Some more text!

96620...01a72## Subheading 1.2
Blah blah blah blah...

a8a5e...93789## Subheading 1.3
Running out of text ideas :\

1cb48...e0efi# Heading 2
Maybe I should have used a Lorem Ipsum generator or something...

Second paragraph.

4ee32...6a839# Heading 3
Or maybe, I should have used less headings:
- Reminder
- For
- Me

b1e43...9698f## Subheading 3.1
Anyway, I'm glad that this is done now.
</pre>
</div>
</div>
