src/01_software/01_editors/001.org
* E#006 (2022-03-05) - Vim, what does X mean? (V)
:PROPERTIES:
:CUSTOM_ID: org601de09
:END:

Updated: (27/06/2022)

Pearls:
- To search for things on Google from within Vim, add the following code to your ~vimrc~:
  - ~vmap <C-3> "zy:let @z = substitute(@z,' ','+','g')<CR>:exec ":silent ! start https://www.google.com/search?q=". @z. ""<CR><CR>~
- This is how it works:
  - Go into Visual mode by pressing ~v~, and highlight the words of interest
  - Press ~Ctrl+3~ (by modifying the ~<C-3>~ in the line of code above, you can make this keyboard shortcut to whatever you want)

I've been wondering if I can use Vim to look up a highlighted word/sentence that is in the current buffer. Perhaps, a way that is more practical than:
1. Copy the thing which you want to search up on the internet
2. Open the browser
3. Paste it in the search bar of your browser
4. Press ~Enter~

And, to my surprise, there was! Here is what you need to add to your ~vimrc~:

#+BEGIN_EXPORT html
<pre>
<code>
vmap &lt;C-3&gt; "zy:let @z = substitute(@z,' ','+','g')&lt;CR&gt;:exec ":silent ! start https://www.google.com/search?q=". @z. ""&lt;CR&gt;&lt;CR&gt;
</code>
</pre>
#+END_EXPORT

So, this is how it works:
1. Go into Visual mode by pressing ~v~, and highlight the words of interest
2. Press ~Ctrl+3~ (by modifying the ~<C-3>~ in the line of code above, you can make this keyboard shortcut to whatever you want)
3. That's it! Isn't that so convenient?!

This was originally something I found online, but for some reason the web answer did not work. So I tweaked the code a bit and it worked. In any case, here's the link to the [[https://vim.fandom.com/wiki/Search_the_web_for_text_selected_in_Vim][original answer]].

* E#005 (2021-05-21) - jump like a rabbit! (V)
:PROPERTIES:
:CUSTOM_ID: org35f3b8c
:END:

Pearls:
- Vim has several different modes. You use Normal mode to navigate through your text. Whereas you use Insert mode to insert text (obviously). Typing ~:~ will activate Command mode.
- ~w~ to jump FORWARD to the start of the next word in a sentence (thinks that hyphens, dots, commas, etc. are actually spaces, and will hence treat them as such). For example, "Vim-is-a-modal-text-editor" will be treated as having 11 words.
  - ~e~ will do the same thing, except it will jump to the end of the current word.
  - ~b~ will do the same thing, except it goes BACKWARD.
- ~W~ to jump FORWARD to the start of the next word in a sentence (thinks that ONLY the words separated by spaces are true words). For example, "Vim-is-a-modal-text-editor" will be treated as having only one word.
  - ~E~ will do the same thing, except it will jump to the end of the current word.
  - ~B~ will do the same thing, except it goes BACKWARD.
- Save and exit. See this [[../02_pearls/editors_1_pearls.org#e3-21042021---notepad--vim][pearl entry]] to learn more about a third method.:
   - ~:x~ will do the same thing as ~:wq~ except that it will not save the file if you have not made a change.
   - ~ZZ~ will do the same thing as ~:x~ (and hence ~:wq~).

- ~GTs~:
    - I have already found out that Vim offers different modes. So, to truly understand this concept, I had to completely forget everything I 'knew' about text editors. The main ones I am using at the moment are: Normal, Insert, and Command.
    - Vim keeps breaking long lines to smaller ones (not just visually wrapping, but actually changing the text). Not sure whether or not this is useful just yet.
- Time spent: 45
- ~LPs~:
    - I learned about 2 more different ways which you can save and exit the file in Vim.
	 - In Vim, we have two types of 'words'. For example, Vim can read the following statement as an 11-word sentence or a one-word sentence: "Vim-is-a-modal-text-editor". You can find out more about this by going over to the pearl entry!
- ~LNs~:
    - I need to find out how to stop Vim from automatically inserting line breaks.
- ~AP~ {}: I need to find out how to stop Vim from automatically inserting line breaks when the line is too long. This is quite urgent because, at the moment, I'm not a big fan of this feature (in terms of writing these entries). However, I am sure that it will be useful when writing a piece of code.
- ~Review~:
    - I reviewed APE#004
    - ~New LPs~:
        - You can paste from the system clipboard (rather than from the Vim register) by typing ~"+p~ or ~"+P~ (depending on where you prefer to paste the line. You can refer to this [[../02_pearls/editors_1_pearls.org#e4-10052021---a-clipboard-dilemma][pearl entry]] to learn more about the types of pasting in Vim).
    - ~Sources~:
        - I used the answer by the user "Martin Tournoij" on [[https://vi.stackexchange.com/questions/84/how-can-i-copy-text-to-the-system-clipboard-from-vim][here]].

