01_software/01_editors/001.html

<div id="outline-container-org601de09" class="outline-2">
<h2 id="org601de09">E#006 (2022-03-05) - Vim, what does X mean? (V)</h2>
<div class="outline-text-2" id="text-org601de09">
<p>
Updated: (27/06/2022)
</p>

<p>
Pearls:
</p>
<ul class="org-ul">
<li>To search for things on Google from within Vim, add the following code to your <code>vimrc</code>:
<ul class="org-ul">
<li><code>vmap &lt;C-3&gt; "zy:let @z = substitute(@z,' ','+','g')&lt;CR&gt;:exec ":silent ! start https://www.google.com/search?q=". @z. ""&lt;CR&gt;&lt;CR&gt;</code></li>
</ul></li>
<li>This is how it works:
<ul class="org-ul">
<li>Go into Visual mode by pressing <code>v</code>, and highlight the words of interest</li>
<li>Press <code>Ctrl+3</code> (by modifying the <code>&lt;C-3&gt;</code> in the line of code above, you can make this keyboard shortcut to whatever you want)</li>
</ul></li>
</ul>

<p>
I've been wondering if I can use Vim to look up a highlighted word/sentence that is in the current buffer. Perhaps, a way that is more practical than:
</p>
<ol class="org-ol">
<li>Copy the thing which you want to search up on the internet</li>
<li>Open the browser</li>
<li>Paste it in the search bar of your browser</li>
<li>Press <code>Enter</code></li>
</ol>

<p>
And, to my surprise, there was! Here is what you need to add to your <code>vimrc</code>:
</p>

<pre>
<code>
vmap &lt;C-3&gt; "zy:let @z = substitute(@z,' ','+','g')&lt;CR&gt;:exec ":silent ! start https://www.google.com/search?q=". @z. ""&lt;CR&gt;&lt;CR&gt;
</code>
</pre>

<p>
So, this is how it works:
</p>
<ol class="org-ol">
<li>Go into Visual mode by pressing <code>v</code>, and highlight the words of interest</li>
<li>Press <code>Ctrl+3</code> (by modifying the <code>&lt;C-3&gt;</code> in the line of code above, you can make this keyboard shortcut to whatever you want)</li>
<li>That's it! Isn't that so convenient?!</li>
</ol>

<p>
This was originally something I found online, but for some reason the web answer did not work. So I tweaked the code a bit and it worked. In any case, here's the link to the <a href="https://vim.fandom.com/wiki/Search_the_web_for_text_selected_in_Vim">original answer</a>.
</p>
</div>
</div>

<div id="outline-container-org35f3b8c" class="outline-2">
<h2 id="org35f3b8c">E#005 (2021-05-21) - jump like a rabbit! (V)</h2>
<div class="outline-text-2" id="text-org35f3b8c">
<p>
Pearls:
</p>
<ul class="org-ul">
<li>Vim has several different modes. You use Normal mode to navigate through your text. Whereas you use Insert mode to insert text (obviously). Typing <code>:</code> will activate Command mode.</li>
<li><code>w</code> to jump FORWARD to the start of the next word in a sentence (thinks that hyphens, dots, commas, etc. are actually spaces, and will hence treat them as such). For example, "Vim-is-a-modal-text-editor" will be treated as having 11 words.
<ul class="org-ul">
<li><code>e</code> will do the same thing, except it will jump to the end of the current word.</li>
<li><code>b</code> will do the same thing, except it goes BACKWARD.</li>
</ul></li>
<li><code>W</code> to jump FORWARD to the start of the next word in a sentence (thinks that ONLY the words separated by spaces are true words). For example, "Vim-is-a-modal-text-editor" will be treated as having only one word.
<ul class="org-ul">
<li><code>E</code> will do the same thing, except it will jump to the end of the current word.</li>
<li><code>B</code> will do the same thing, except it goes BACKWARD.</li>
</ul></li>
<li>Save and exit. See this <a href="../02_pearls/editors_1_pearls.org#e3-21042021---notepad--vim">pearl entry</a> to learn more about a third method.:
<ul class="org-ul">
<li><code>:x</code> will do the same thing as <code>:wq</code> except that it will not save the file if you have not made a change.</li>
<li><code>ZZ</code> will do the same thing as <code>:x</code> (and hence <code>:wq</code>).</li>
</ul></li>

<li><code>GTs</code>:
<ul class="org-ul">
<li>I have already found out that Vim offers different modes. So, to truly understand this concept, I had to completely forget everything I 'knew' about text editors. The main ones I am using at the moment are: Normal, Insert, and Command.</li>
<li>Vim keeps breaking long lines to smaller ones (not just visually wrapping, but actually changing the text). Not sure whether or not this is useful just yet.</li>
</ul></li>
<li>Time spent: 45</li>
<li><code>LPs</code>:
<ul class="org-ul">
<li>I learned about 2 more different ways which you can save and exit the file in Vim.
<ul class="org-ul">
<li>In Vim, we have two types of 'words'. For example, Vim can read the following statement as an 11-word sentence or a one-word sentence: "Vim-is-a-modal-text-editor". You can find out more about this by going over to the pearl entry!</li>
</ul></li>
</ul></li>
<li><code>LNs</code>:
<ul class="org-ul">
<li>I need to find out how to stop Vim from automatically inserting line breaks.</li>
</ul></li>
<li><code>AP</code> {}: I need to find out how to stop Vim from automatically inserting line breaks when the line is too long. This is quite urgent because, at the moment, I'm not a big fan of this feature (in terms of writing these entries). However, I am sure that it will be useful when writing a piece of code.</li>
<li><code>Review</code>:
<ul class="org-ul">
<li>I reviewed APE#004</li>
<li><code>New LPs</code>:
<ul class="org-ul">
<li>You can paste from the system clipboard (rather than from the Vim register) by typing <code>"+p</code> or <code>"+P</code> (depending on where you prefer to paste the line. You can refer to this <a href="../02_pearls/editors_1_pearls.org#e4-10052021---a-clipboard-dilemma">pearl entry</a> to learn more about the types of pasting in Vim).</li>
</ul></li>
<li><code>Sources</code>:
<ul class="org-ul">
<li>I used the answer by the user "Martin Tournoij" on <a href="https://vi.stackexchange.com/questions/84/how-can-i-copy-text-to-the-system-clipboard-from-vim">here</a>.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
