src/01_software/01_editors/001.org
* E#004 (2021-05-10) - a clipboard dilemma. (V)
:PROPERTIES:
:CUSTOM_ID: org936d260
:END:

Updated: (20/05/2021)

Pearls:
- ~yy~ to yank (copy) the line into the Vim register.
  - Combine this with ~p~ to get ~yyp~ and hence duplicate the current line.
- ~yw~ to yank (copy) the word under the cursor into the Vim register.
- ~p~ to paste the content stored in the Vim register AFTER the cursor.
- ~P~ to paste the content stored in the Vim register BEFORE the cursor.
- ~u~ to undo a change.
- ~U~ to undo all changes on the CURRENT line.
- ~Ctrl+r~ to redo.
- Go to line X
  - ~:~ and then any number of your choice. This will take you to that particular line in your current file. So, ~:33~ will take me to line 33.
  - Type a number followed by ~G~ (e.g., the example above would be ~33G~) to get the same result.
  - Type a number followed by ~gg~ (e.g., the example above would be ~33gg~) to get the same result.
- ~/~ followed by any word of your choice to search FORWARD. After that, you can press ~n~ to cycle through the matches (use ~N~ to search in the opposite direction).
- ~?~ followed by any word of your choice to search BACKWARD. After that, you can press ~n~ to cycle through the matches (use ~N~ to search in the opposite direction).

- ~GTs~:
    - I noticed that pressing ~p~ whilst in Normal mode, does not actually paste the content which I copied outside of Vim. In other words, Vim seems to have its own unique clipboard (which, according to the internet, is called a "register"). Awesome!
    - I have finished going through ~vimtutor~ twice now. The first time was on 23/04/2021 and the second time was on 25/04/2021. The problem is that I keep forgetting some of the commands due to the lack of use.
    - Fun fact: this entry was written using Vim.
- Time spent: 30
- ~LPs~:
    - I learned that the Vim register is separate from the Windows clipboard.
- ~LNs~:
    - I need to find out how to access the Windows clipboard rather than the Vim register. 
- ~AP~ {}: I need to find out how to access the system clipboard rather than the Vim register, which is (as usual) relatively easy to achieve thanks to this thing that is called "the internet".
- ~Review~:
    - I reviewed APE#003.
    - ~New LPs~:
        - To duplicate a line in Vim, you need to first be in Normal mode (done by pressing Escape on your keyboard). Then, type ~yy~ on the line which you want to duplicate. This will yank (copy) it. Now, press ~P~ to paste the line above the current line, or press ~p~ to paste it below the current line. So, in short, just type ~yyp~!
    - ~Sources~:

        - Here is the [[https://stackoverflow.com/questions/73319/how-to-duplicate-a-whole-line-in-vim][website]] which was used.

* E#003 (2021-04-21) - Notepad++ > Vim?! (V)
:PROPERTIES:
:CUSTOM_ID: org4016a33
:END:

Updated: (19/05/2021)

Pearls:
- ~x~ to delete the character AFTER the cursor.
- ~X~ to delete the character BEFORE the cursor.
- ~A~ to insert text at the end of the line.
- ~I~ to insert text at the start of the line.
- ~a~ to insert text AFTER the cursor.
- ~i~ to insert text BEFORE the cursor.
- ~dd~ to delete the whole line.
- ~d$~ or ~D~ to delete from the current position to the end of the line.
- ~:wq~ to write (hence the ~w~) the changes, and then quit Vim (hence the ~q~). This will save your buffer whether or not you made a change.

- ~GTs~:
    - Vim is great, but I started to notice that there were a couple of features that Notepad++ had, which seem to be not as accessible in Vim. For example, duplicating the current line, auto-complete, case conversion, and macros.
- Time spent: 15
- ~LPs~:
    - I learned how to delete the character that is directly under the cursor by pressing the letter ~x~. I think this is a better alternative to pressing ~del~ (which is at the top-right corner of my keyboard). Much more comfortable!
- ~LNs~:
    - I need to find out how to duplicate the current line in Vim.
- ~AP~ {x 10/05/2021}: I need to find out how to duplicate the current line in Vim, which is easy to achieve thanks to the internet!
- ~Review~:
    - I reviewed APE#002
    - ~New LPs~:
        - I learned how to copy and paste in Vim, it is quite quick and convenient too. All I had to do is press the letter ~y~ for "yank" (which means "copy" in the Vim lingo), and the letter ~p~ for "paste".
    - ~Sources~:
        - Here is the [[https://linuxize.com/post/how-to-copy-cut-paste-in-vim/][website]] which was used.

* E#002 (2021-04-20) - vimtutor. (V)
:PROPERTIES:
:CUSTOM_ID: org44339bb
:END:

Pearls:
- The ~vimtutor~ file is located in ~/Vim/vim82/tutor~.
- ~:set guifont=*~ to change the font of the interface.
- ~i~ to enter Insert mode.
- Use the Escape button, ~Esc~, to return to Normal mode.
- Whilst in Normal mode, you can move up, down, right, and left by using the following keys: ~k~, ~j~, ~l~, and ~h~, respectively (remember, ~j~ looks like a down arrow!).

- ~GTs~:
    - I found the ~vimtutor~ file! It took about a minute or two to achieve this.
    - The interface is minimalistic and is not crowded with buttons. I like this quite a lot.
- Time spent: 30
- ~LPs~:
    - I found out how to modify the font-size! So, basically I had to write the following ~:set guifont=*~, and this brought up the standard font window that you see in pretty much every text editor. Neat!
    - I learned to make the font persistent (see the [[https://vi.stackexchange.com/questions/3093/how-can-i-change-the-font-size-in-gvim][comment]] by the user "pkout"). I had to use Notepad++ to achieve this because: one, I did not know how to copy/paste text in Vim, and two, I don't know how to open text files via Vim.
    - Using ~vimtutor~, I learned that the letter ~j~ moves the text cursor downwards (because it looks like a down arrow!), and the letter ~k~ moves it up. The letter ~l~ moves the cursor to the right, and finally, the letter ~h~ moves the cursor to the left! It was a little strange to use at the start, but I slowly started to love it.
- ~LNs~:
    - I need to learn how to open a text file in Vim (from within the editor).
    - I need to learn how to copy/paste text in Vim.
- ~AP~ {x 21/04/2021}: I need learn how to copy/paste text in Vim. This should be easy to achieve with a quick Google search.
- ~Review~:
    - I reviewed APE#001
    - ~New LPs~:
        - I found the location of ~vimtutor~ in ~/Vim/vim82/tutor~. It was simply called ~tutor~. To find it, I used the following search string in Windows Explorer ~~=tut~.
    - ~Sources~:
        - Self-discovery.

