01_software/01_editors/001.html

<div id="outline-container-org936d260" class="outline-2">
<h2 id="org936d260">E#004 (2021-05-10) - a clipboard dilemma. (V)</h2>
<div class="outline-text-2" id="text-org936d260">
<p>
Updated: (20/05/2021)
</p>

<p>
Pearls:
</p>
<ul class="org-ul">
<li><code>yy</code> to yank (copy) the line into the Vim register.
<ul class="org-ul">
<li>Combine this with <code>p</code> to get <code>yyp</code> and hence duplicate the current line.</li>
</ul></li>
<li><code>yw</code> to yank (copy) the word under the cursor into the Vim register.</li>
<li><code>p</code> to paste the content stored in the Vim register AFTER the cursor.</li>
<li><code>P</code> to paste the content stored in the Vim register BEFORE the cursor.</li>
<li><code>u</code> to undo a change.</li>
<li><code>U</code> to undo all changes on the CURRENT line.</li>
<li><code>Ctrl+r</code> to redo.</li>
<li>Go to line X
<ul class="org-ul">
<li><code>:</code> and then any number of your choice. This will take you to that particular line in your current file. So, <code>:33</code> will take me to line 33.</li>
<li>Type a number followed by <code>G</code> (e.g., the example above would be <code>33G</code>) to get the same result.</li>
<li>Type a number followed by <code>gg</code> (e.g., the example above would be <code>33gg</code>) to get the same result.</li>
</ul></li>
<li><code>/</code> followed by any word of your choice to search FORWARD. After that, you can press <code>n</code> to cycle through the matches (use <code>N</code> to search in the opposite direction).</li>
<li><code>?</code> followed by any word of your choice to search BACKWARD. After that, you can press <code>n</code> to cycle through the matches (use <code>N</code> to search in the opposite direction).</li>

<li><code>GTs</code>:
<ul class="org-ul">
<li>I noticed that pressing <code>p</code> whilst in Normal mode, does not actually paste the content which I copied outside of Vim. In other words, Vim seems to have its own unique clipboard (which, according to the internet, is called a "register"). Awesome!</li>
<li>I have finished going through <code>vimtutor</code> twice now. The first time was on 23/04/2021 and the second time was on 25/04/2021. The problem is that I keep forgetting some of the commands due to the lack of use.</li>
<li>Fun fact: this entry was written using Vim.</li>
</ul></li>
<li>Time spent: 30</li>
<li><code>LPs</code>:
<ul class="org-ul">
<li>I learned that the Vim register is separate from the Windows clipboard.</li>
</ul></li>
<li><code>LNs</code>:
<ul class="org-ul">
<li>I need to find out how to access the Windows clipboard rather than the Vim register.</li>
</ul></li>
<li><code>AP</code> {}: I need to find out how to access the system clipboard rather than the Vim register, which is (as usual) relatively easy to achieve thanks to this thing that is called "the internet".</li>
<li><code>Review</code>:
<ul class="org-ul">
<li>I reviewed APE#003.</li>
<li><code>New LPs</code>:
<ul class="org-ul">
<li>To duplicate a line in Vim, you need to first be in Normal mode (done by pressing Escape on your keyboard). Then, type <code>yy</code> on the line which you want to duplicate. This will yank (copy) it. Now, press <code>P</code> to paste the line above the current line, or press <code>p</code> to paste it below the current line. So, in short, just type <code>yyp</code>!</li>
</ul></li>
<li><code>Sources</code>:

<ul class="org-ul">
<li>Here is the <a href="https://stackoverflow.com/questions/73319/how-to-duplicate-a-whole-line-in-vim">website</a> which was used.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4016a33" class="outline-2">
<h2 id="org4016a33">E#003 (2021-04-21) - Notepad++ &gt; Vim?! (V)</h2>
<div class="outline-text-2" id="text-org4016a33">
<p>
Updated: (19/05/2021)
</p>

<p>
Pearls:
</p>
<ul class="org-ul">
<li><code>x</code> to delete the character AFTER the cursor.</li>
<li><code>X</code> to delete the character BEFORE the cursor.</li>
<li><code>A</code> to insert text at the end of the line.</li>
<li><code>I</code> to insert text at the start of the line.</li>
<li><code>a</code> to insert text AFTER the cursor.</li>
<li><code>i</code> to insert text BEFORE the cursor.</li>
<li><code>dd</code> to delete the whole line.</li>
<li><code>d$</code> or <code>D</code> to delete from the current position to the end of the line.</li>
<li><code>:wq</code> to write (hence the <code>w</code>) the changes, and then quit Vim (hence the <code>q</code>). This will save your buffer whether or not you made a change.</li>

<li><code>GTs</code>:
<ul class="org-ul">
<li>Vim is great, but I started to notice that there were a couple of features that Notepad++ had, which seem to be not as accessible in Vim. For example, duplicating the current line, auto-complete, case conversion, and macros.</li>
</ul></li>
<li>Time spent: 15</li>
<li><code>LPs</code>:
<ul class="org-ul">
<li>I learned how to delete the character that is directly under the cursor by pressing the letter <code>x</code>. I think this is a better alternative to pressing <code>del</code> (which is at the top-right corner of my keyboard). Much more comfortable!</li>
</ul></li>
<li><code>LNs</code>:
<ul class="org-ul">
<li>I need to find out how to duplicate the current line in Vim.</li>
</ul></li>
<li><code>AP</code> {x 10/05/2021}: I need to find out how to duplicate the current line in Vim, which is easy to achieve thanks to the internet!</li>
<li><code>Review</code>:
<ul class="org-ul">
<li>I reviewed APE#002</li>
<li><code>New LPs</code>:
<ul class="org-ul">
<li>I learned how to copy and paste in Vim, it is quite quick and convenient too. All I had to do is press the letter <code>y</code> for "yank" (which means "copy" in the Vim lingo), and the letter <code>p</code> for "paste".</li>
</ul></li>
<li><code>Sources</code>:
<ul class="org-ul">
<li>Here is the <a href="https://linuxize.com/post/how-to-copy-cut-paste-in-vim/">website</a> which was used.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org44339bb" class="outline-2">
<h2 id="org44339bb">E#002 (2021-04-20) - vimtutor. (V)</h2>
<div class="outline-text-2" id="text-org44339bb">
<p>
Pearls:
</p>
<ul class="org-ul">
<li>The <code>vimtutor</code> file is located in <code>/Vim/vim82/tutor</code>.</li>
<li><code>:set guifont=*</code> to change the font of the interface.</li>
<li><code>i</code> to enter Insert mode.</li>
<li>Use the Escape button, <code>Esc</code>, to return to Normal mode.</li>
<li>Whilst in Normal mode, you can move up, down, right, and left by using the following keys: <code>k</code>, <code>j</code>, <code>l</code>, and <code>h</code>, respectively (remember, <code>j</code> looks like a down arrow!).</li>

<li><code>GTs</code>:
<ul class="org-ul">
<li>I found the <code>vimtutor</code> file! It took about a minute or two to achieve this.</li>
<li>The interface is minimalistic and is not crowded with buttons. I like this quite a lot.</li>
</ul></li>
<li>Time spent: 30</li>
<li><code>LPs</code>:
<ul class="org-ul">
<li>I found out how to modify the font-size! So, basically I had to write the following <code>:set guifont=*</code>, and this brought up the standard font window that you see in pretty much every text editor. Neat!</li>
<li>I learned to make the font persistent (see the <a href="https://vi.stackexchange.com/questions/3093/how-can-i-change-the-font-size-in-gvim">comment</a> by the user "pkout"). I had to use Notepad++ to achieve this because: one, I did not know how to copy/paste text in Vim, and two, I don't know how to open text files via Vim.</li>
<li>Using <code>vimtutor</code>, I learned that the letter <code>j</code> moves the text cursor downwards (because it looks like a down arrow!), and the letter <code>k</code> moves it up. The letter <code>l</code> moves the cursor to the right, and finally, the letter <code>h</code> moves the cursor to the left! It was a little strange to use at the start, but I slowly started to love it.</li>
</ul></li>
<li><code>LNs</code>:
<ul class="org-ul">
<li>I need to learn how to open a text file in Vim (from within the editor).</li>
<li>I need to learn how to copy/paste text in Vim.</li>
</ul></li>
<li><code>AP</code> {x 21/04/2021}: I need learn how to copy/paste text in Vim. This should be easy to achieve with a quick Google search.</li>
<li><code>Review</code>:
<ul class="org-ul">
<li>I reviewed APE#001</li>
<li><code>New LPs</code>:
<ul class="org-ul">
<li>I found the location of <code>vimtutor</code> in <code>/Vim/vim82/tutor</code>. It was simply called <code>tutor</code>. To find it, I used the following search string in Windows Explorer <code>~=tut</code>.</li>
</ul></li>
<li><code>Sources</code>:
<ul class="org-ul">
<li>Self-discovery.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
