src/01_software/01_editors/001.org
* E#001 (2021-04-19) - day 0. (V)
:PROPERTIES:
:CUSTOM_ID: org6bad0ce
:END:

Pearls:
- To enter commands into Vim, you should write ~:~. After doing so, you will notice that your cursor has moved to the bottom of the screen.
- ~:q!~ to quit Vim without saving the changes.

- ~GTs~:
    - Straight away, I noticed that the font was too small! I had no clue how to increase the font-size.
    - There was a README file which didn't have much in it. It was some sort of "here is a list of good links to use when you need help". But it did talk about this ~vimtutor~. I need to look into it soon.
    - There is some GUI? I thought it was literally just text cursor and a bunch of commands (this was the case in Linux).
    - I can actually exit the editor this time! ~:q!~. This will probably get quite tedious over time (or maybe not!).
- Time spent: 10
- ~LPs~:
    - I learned that there seems to be different versions of Vim. For example, I can see that there is ~gVim~, ~gVim Read only~, and ~gVim Easy~, etc. Not entirely sure what they are.
- ~LNs~:
    - I need to look into ~vimtutor~.
- ~AP~ {x 20/04/2021}: I need look into ~vimtutor~, and find the file location. This should be relatively easy to achieve.
