01_software/01_editors/001.html

<div id="outline-container-org6bad0ce" class="outline-2">
<h2 id="org6bad0ce">E#001 (2021-04-19) - day 0. (V)</h2>
<div class="outline-text-2" id="text-org6bad0ce">
<p>
Pearls:
</p>
<ul class="org-ul">
<li>To enter commands into Vim, you should write <code>:</code>. After doing so, you will notice that your cursor has moved to the bottom of the screen.</li>
<li><code>:q!</code> to quit Vim without saving the changes.</li>

<li><code>GTs</code>:
<ul class="org-ul">
<li>Straight away, I noticed that the font was too small! I had no clue how to increase the font-size.</li>
<li>There was a README file which didn't have much in it. It was some sort of "here is a list of good links to use when you need help". But it did talk about this <code>vimtutor</code>. I need to look into it soon.</li>
<li>There is some GUI? I thought it was literally just text cursor and a bunch of commands (this was the case in Linux).</li>
<li>I can actually exit the editor this time! <code>:q!</code>. This will probably get quite tedious over time (or maybe not!).</li>
</ul></li>
<li>Time spent: 10</li>
<li><code>LPs</code>:
<ul class="org-ul">
<li>I learned that there seems to be different versions of Vim. For example, I can see that there is <code>gVim</code>, <code>gVim Read only</code>, and <code>gVim Easy</code>, etc. Not entirely sure what they are.</li>
</ul></li>
<li><code>LNs</code>:
<ul class="org-ul">
<li>I need to look into <code>vimtutor</code>.</li>
</ul></li>
<li><code>AP</code> {x 20/04/2021}: I need look into <code>vimtutor</code>, and find the file location. This should be relatively easy to achieve.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
